Revit 2027 API
PartMakerMethodToDivideVolumes.ProfileFlipAcross Property
 True if the corresponding left/upper parts profile are mirrored with respect to the division line. False if the profile of left/upper parts are defined directly by the profile family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ProfileFlipAcross { get; set; }
Public Property ProfileFlipAcross As Boolean
	Get
	Set
public:
property bool ProfileFlipAcross {
	bool get ();
	void set (bool value);
}
member ProfileFlipAcross : bool with get, set
Property Value
Boolean
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace